/* 변수와 상수 */
// - 변수와 상수는 특정 이름에 특정 값을 담을 때 사용합니다.

// let value = 1;
// value라는 이름에 1 값을 넣고 console로 확인하면 1이 나온다.
// console.log(value);
// 특정 이름에 값을 설정하는것을 "선언" 이라고 말한다.

/* 변수 */
// 변수는 바뀔수 있는 값을 말한다. (한번 값을 선언하면 다시 바꿀 수 있음)
// 변수를 선언할때는 "let" 이라는 키워드를 사용한다. (한번 선언하면 똑같은 이름으로 선언하지 못한다.)
// 단!!!!, 다른 블록 범위에서는 똑같은 이름으로 사용이 가능하긴 하다.
let value = 1;
console.log(value) 
value = 2;
console.log(value) 

/* 상수 */
// 상수는 한번 선언하고 값이 바뀌지 않는 값을 의미합니다. (값이 고정적)

// 상수를 선언할때에는 "const" 이라는 키워드를 사용한다. (산안하면 값을 바꿀수 없다.)
const a = 1;
// a = 2;
// 콘솔창에 에러가 뜨는데 이는 한번 상수값을 선언했으면 다른값으로 선언할 수 없기 때문임. (마찬가지로 선언한 이름을 똑같이 쓸 수 없다.)



